using System;
namespace _C_AR17_中__不同基底整數轉換
{
    class Program
    {
        static void Main(string[] args)
        {
            //for (int i = 0; i < 21; i++) {Console.ReadLine();}

            Console.WriteLine("7 4 1\n8 5 2\n9 6 3\n\n1 2\n3 4\n\n1 6 11 16 21\n2 7 12 17 22\n3 8 13 18 23\n4 9 14 19 24\n5 10 15 20 25\n\n16 12 8 4\n15 11 7 3\n14 10 6 2\n13 9 5 1\n\n16 15 14 13\n12 11 10 9\n8 7 6 5\n4 3 2 1\n\n4 3 2 1\n8 7 6 5\n12 11 10 9\n16 15 14 13\n\n4 8 12 16\n3 7 11 15\n2 6 10 14\n1 5 9 13\n\n21 22 23 24 25\n16 17 18 19 20\n11 12 13 14 15\n6 7 8 9 10\n1 2 3 4 5\n\n25 24 23 22 21\n20 19 18 17 16\n15 14 13 12 11\n10 9 8 7 6\n5 4 3 2 1\n\n1 2 3 4 5\n6 7 8 9 10\n11 12 13 14 15\n16 17 18 19 20\n21 22 23 24 25");

        }      
    }
}
